/* 틈새살이 좌표 파일 - 좌표 수정 도구(좌표수정도구.html)로 만든다. 직접 고치지 말 것.
   저장 시각: 2026. 10. 18. 오전 12:10:19 */
window.TEUM_TUNER_STATE = {
  "table": {
    "top": 47.1,
    "left": 31.3,
    "width": 55
  },
  "fridgeEmpty": {
    "top": 26.7,
    "left": 5,
    "width": 28.9
  },
  "sortY": 64,
  "kitchenFridgeIcon": {
    "top": 31.6,
    "left": 15.1,
    "size": 100
  },
  "fridgePoint": {
    "top": 70.1,
    "left": 20.5
  },
  "playerStart": {
    "top": 94,
    "left": 49.95
  },
  "colliders": {
    "fridge": {
      "label": "냉장고 바닥",
      "points": [
        {
          "x": 5.2,
          "y": 62.7
        },
        {
          "x": 12.3,
          "y": 68.2
        },
        {
          "x": 22.7,
          "y": 63.2
        },
        {
          "x": 22.3,
          "y": 35.6
        },
        {
          "x": 15.6,
          "y": 30.1
        },
        {
          "x": 5.5,
          "y": 34.7
        },
        {
          "x": 5,
          "y": 62.7
        }
      ]
    },
    "table": {
      "label": "식탁 바닥",
      "points": [
        {
          "x": 42.8,
          "y": 74.1
        },
        {
          "x": 45,
          "y": 80.6
        },
        {
          "x": 57.7,
          "y": 88.5
        },
        {
          "x": 65.8,
          "y": 88.1
        },
        {
          "x": 75.7,
          "y": 82.2
        },
        {
          "x": 75.5,
          "y": 68.5
        },
        {
          "x": 58.9,
          "y": 59.6
        },
        {
          "x": 42.9,
          "y": 73.9
        }
      ]
    },
    "counter": {
      "label": "싱크대/조리대 바닥",
      "points": [
        {
          "x": 23.2,
          "y": 60.1
        },
        {
          "x": 26.2,
          "y": 62.7
        },
        {
          "x": 53,
          "y": 49.6
        },
        {
          "x": 52.8,
          "y": 4.4
        },
        {
          "x": 20,
          "y": 19
        },
        {
          "x": 21.9,
          "y": 33
        },
        {
          "x": 22.9,
          "y": 48.6
        },
        {
          "x": 22.6,
          "y": 59.9
        }
      ]
    },
    "shelf": {
      "label": "선반/화분 바닥",
      "points": [
        {
          "x": 53.6,
          "y": 49.6
        },
        {
          "x": 91,
          "y": 75.2
        },
        {
          "x": 98.2,
          "y": 70.5
        },
        {
          "x": 98,
          "y": 29.8
        },
        {
          "x": 53.1,
          "y": 4.8
        },
        {
          "x": 53.9,
          "y": 49.9
        }
      ]
    }
  },
  "utility": {
    "laundry": {
      "top": 46.5,
      "left": 56.9,
      "width": 14.1
    },
    "laundryIcon": {
      "top": 43,
      "left": 64.3,
      "size": 100
    },
    "laundryPoint": {
      "top": 70,
      "left": 52
    },
    "laundryBasket": {
      "top": 60.4,
      "left": 64.3,
      "width": 13.5
    },
    "laundryClothes": {
      "top": 50,
      "left": 62.1,
      "width": 14
    },
    "colliders": {},
    "fridge": {
      "top": 26.7,
      "left": 5,
      "width": 28.9
    },
    "fridgeIcon": {
      "top": 31.6,
      "left": 15.1,
      "size": 100
    },
    "fridgePoint": {
      "top": 81,
      "left": 29
    }
  },
  "eunminKitchen": {
    "diningTable": {
      "top": 53.2,
      "left": 29.5,
      "width": 50
    },
    "livingroomPoint": {
      "top": 80,
      "left": 85
    },
    "sinkIcon": {
      "top": 31.4,
      "left": 37.9,
      "size": 194
    },
    "sinkPoint": {
      "top": 54.7,
      "left": 45
    },
    "binsIcon": {
      "top": 44.8,
      "left": 87.8,
      "size": 194
    },
    "binsPoint": {
      "top": 69.2,
      "left": 78.2
    },
    "bubbleIcon": {
      "top": 25,
      "left": 65,
      "size": 169
    },
    "colliders": {
      "sink": {
        "label": "싱크대 바닥",
        "points": [
          {
            "x": 4.6,
            "y": 65.2
          },
          {
            "x": 10.6,
            "y": 70.1
          },
          {
            "x": 24.6,
            "y": 62
          },
          {
            "x": 26,
            "y": 63.4
          },
          {
            "x": 53.1,
            "y": 49.2
          },
          {
            "x": 74.4,
            "y": 63.4
          },
          {
            "x": 75,
            "y": 49.5
          },
          {
            "x": 81.1,
            "y": 46.5
          },
          {
            "x": 82.9,
            "y": 22.2
          },
          {
            "x": 50.3,
            "y": 3.7
          },
          {
            "x": 3.1,
            "y": 27.5
          },
          {
            "x": 4,
            "y": 65.9
          }
        ]
      },
      "bins": {
        "label": "쓰레기통 바닥",
        "points": [
          {
            "x": 76,
            "y": 62.7
          },
          {
            "x": 91.8,
            "y": 73.6
          },
          {
            "x": 97.4,
            "y": 70.3
          },
          {
            "x": 97.6,
            "y": 30.5
          },
          {
            "x": 83.1,
            "y": 22.4
          },
          {
            "x": 81.4,
            "y": 46.3
          },
          {
            "x": 74.9,
            "y": 50
          },
          {
            "x": 75.4,
            "y": 62.7
          }
        ]
      },
      "table": {
        "label": "식탁 바닥",
        "points": [
          {
            "x": 39.8,
            "y": 76.9
          },
          {
            "x": 42.0,
            "y": 83.4
          },
          {
            "x": 56.0,
            "y": 91.7
          },
          {
            "x": 61.3,
            "y": 88.9
          },
          {
            "x": 70.6,
            "y": 84.4
          },
          {
            "x": 70.6,
            "y": 72.4
          },
          {
            "x": 52.4,
            "y": 61.1
          },
          {
            "x": 39.5,
            "y": 69.7
          },
          {
            "x": 39.7,
            "y": 77.2
          }
        ]
      },
      "floor": {
        "label": "이동 가능 영역",
        "points": [
          {
            "x": 3.3,
            "y": 66.3
          },
          {
            "x": 47.9,
            "y": 97.6
          },
          {
            "x": 97,
            "y": 70.4
          },
          {
            "x": 50.6,
            "y": 43.9
          },
          {
            "x": 3.1,
            "y": 66.2
          }
        ]
      }
    },
    "dishWash": {
      "top": 29.4,
      "left": 32.8,
      "width": 19.4
    },
    "trash": {
      "top": 43,
      "left": 77.5,
      "width": 18
    },
    "notice": {
      "top": 60.9,
      "left": 41.8,
      "width": 8.9
    },
    "paperIcon": {
      "top": 60.8,
      "left": 46.1,
      "size": 194
    },
    "paperPoint": {
      "top": 79.8,
      "left": 35.5
    }
  },
  "livingroom": {
    "paperIcon": {
      "top": 56.9,
      "left": 50,
      "size": 194
    },
    "paperPoint": {
      "top": 74,
      "left": 50
    },
    "colliders": {
      "sofa": {
        "label": "소파 바닥",
        "points": [
          {
            "x": 8.6,
            "y": 66.9
          },
          {
            "x": 43.9,
            "y": 45.8
          },
          {
            "x": 46.9,
            "y": 44.1
          },
          {
            "x": 44.6,
            "y": 37.4
          },
          {
            "x": 48.5,
            "y": 35.5
          },
          {
            "x": 48.9,
            "y": 3.2
          },
          {
            "x": 2.6,
            "y": 27
          },
          {
            "x": 2.5,
            "y": 60
          },
          {
            "x": 9,
            "y": 67.1
          }
        ]
      },
      "livingTable": {
        "label": "테이블 바닥",
        "points": [
          {
            "x": 25.6,
            "y": 73
          },
          {
            "x": 31.3,
            "y": 78.4
          },
          {
            "x": 36.1,
            "y": 74.1
          },
          {
            "x": 40.8,
            "y": 73.3
          },
          {
            "x": 42.8,
            "y": 74.8
          },
          {
            "x": 60.4,
            "y": 64
          },
          {
            "x": 61.4,
            "y": 59.1
          },
          {
            "x": 47.2,
            "y": 49.4
          },
          {
            "x": 29.2,
            "y": 59.1
          },
          {
            "x": 29.2,
            "y": 63.7
          },
          {
            "x": 30.7,
            "y": 65.7
          },
          {
            "x": 25.7,
            "y": 70.4
          },
          {
            "x": 26,
            "y": 73.1
          }
        ]
      },
      "bookshelf": {
        "label": "책장 바닥",
        "points": [
          {
            "x": 48.9,
            "y": 2.8
          },
          {
            "x": 97.8,
            "y": 31.3
          },
          {
            "x": 97.6,
            "y": 66.9
          },
          {
            "x": 94.4,
            "y": 69.4
          },
          {
            "x": 82.5,
            "y": 60.8
          },
          {
            "x": 48.9,
            "y": 38.2
          },
          {
            "x": 49.2,
            "y": 3
          }
        ]
      },
      "floor": {
        "label": "이동 가능 영역",
        "points": [
          {
            "x": 1.9,
            "y": 60.7
          },
          {
            "x": 47.7,
            "y": 98.2
          },
          {
            "x": 97.7,
            "y": 66.9
          },
          {
            "x": 49.9,
            "y": 33.3
          },
          {
            "x": 2.1,
            "y": 60.4
          }
        ]
      }
    }
  },
  "savedAt": 1792249819138
};
